#+TITLE: Better Error Handling

* Intro
We want snoopdb to fail less, or to fail gracefully. If it gets an audit event
that it does not know what to do with, note the event and carry on. Currently,
unexpected events causes the whole thing to shut down and stop people from
working.
* Background
* Design
* Process
** stop maintaining releases.yaml? get latest release dynamically?
** STRT Visit Snooputils as it exists now
** TODO Set up dev loop within pair for this
** TODO Revisit design and process steps
* Questions
** Do we need metadata in our load_audit_events file?
** Can we use this stable release url instead of our releases.yaml?
https://storage.googleapis.com/kubernetes-release/release/stable.txt
https://dl.k8s.io/release/stable.txt
** Can we delete num, in our load_audit_events fn?

** Can we delete apisnoop_baseline_bucket?
** Should we be grabbing latest success the same way for all buckets?
right now 1/3 uses one method 2/3 another method. this will be harder to maintain in the future.
** find operation id work
- when it checks the part_count and does a try except....can we improve the
  error messaging or making this more declarative...feels like a debugger that
  was left in.
-
* Playground
#+begin_src shell
curl -s 'https://api.github.com/repos/kubernetes/kubernetes/releases?per_page=10000&page=6' | jq -r '. | length'
#+end_src

#+RESULTS:
#+begin_example
13
#+end_example
** Look at event
#+begin_src sql-mode
    select data->>'verb', data->'requestURI' from audit_event limit 20;
#+end_src

#+RESULTS:
#+begin_SRC example
 ?column? |                                       ?column?
----------+---------------------------------------------------------------------------------------
 get      | "/readyz"
 get      | "/api/v1/namespaces/kube-system/configmaps/extension-apiserver-authentication"
 get      | "/api?timeout=32s"
 get      | "/api/v1/namespaces/kube-system/pods/konnectivity-server-bootstrap-e2e-master"
 get      | "/apis/storage.k8s.io/v1/csinodes/bootstrap-e2e-master"
 get      | "/api/v1/nodes/bootstrap-e2e-minion-group-gtsl"
 get      | "/apis/events.k8s.io/v1"
 get      | "/apis?timeout=32s"
 get      | "/api/v1/namespaces/kube-system/pods/kube-controller-manager-bootstrap-e2e-master"
 list     | "/api/v1/pods?limit=500&resourceVersion=0"
 list     | "/apis/apiregistration.k8s.io/v1/apiservices?limit=500&resourceVersion=0"
 list     | "/apis/apiextensions.k8s.io/v1/customresourcedefinitions?limit=500&resourceVersion=0"
 list     | "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings?limit=500&resourceVersion=0"
 list     | "/api/v1/endpoints?limit=500&resourceVersion=0"
 list     | "/api/v1/nodes?limit=500&resourceVersion=0"
 list     | "/apis/scheduling.k8s.io/v1/priorityclasses?limit=500&resourceVersion=0"
 list     | "/apis/node.k8s.io/v1/runtimeclasses?limit=500&resourceVersion=0"
 list     | "/api/v1/secrets?limit=500&resourceVersion=0"
 list     | "/api/v1/persistentvolumes?limit=500&resourceVersion=0"
 list     | "/apis/rbac.authorization.k8s.io/v1/roles?limit=500&resourceVersion=0"
(20 rows)

#+end_SRC
